---
type: DoubleParameterValue
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# DoubleParameterValue

`Autodesk.Revit.DB.DoubleParameterValue` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | DoubleParameterValue | — | `` |
| Constructor | DoubleParameterValue | 2016 Subscription Update | `public DoubleParameterValue ()` |
| Property | Value | 2016 Subscription Update | `public double Value { get ; set ; }` |